# ~/.Brewfile
cask_args appdir: '/Applications'
# taps
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'heroku/brew'
# brews
brew 'asdf'
brew 'autoconf'
brew 'autojump'
brew 'automake'
brew 'awscli'
brew 'coreutils'
brew 'dnsmasq'
brew 'exercism'
brew 'gcc'
brew 'git'
brew 'gsl'
brew 'heroku'
brew 'htop'
brew 'kubernetes-cli'
brew 'libtool'
brew 'libxslt'
brew 'libyaml'
brew 'mackup'
brew 'mas'
brew 'mr'
brew 'mtr'
brew 'openssl'
brew 'pcre'
brew 'postgresql'
brew 'pwgen'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ssh-copy-id'
brew 'tmux'
brew 'wget'
brew 'zlib'
brew 'zsh-autosuggestions'
# casks
cask '1password'
cask 'adoptopenjdk8'
cask 'alfred'
cask 'android-studio'
cask 'brave-browser'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'fantastical'
cask 'figma'
cask 'firefox'
cask 'font-hack'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'gpg-suite'
cask 'hazel'
cask 'iterm2'
cask 'keybase'
cask 'microsoft-office'
cask 'ngrok'
cask 'postman'
cask 'rescuetime'
cask 'rocket'
cask 'sequel-pro'
cask 'sketch'
cask 'slack'
cask 'sonos'
cask 'spotify'
cask 'stats'
cask 'synology-drive'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'viscosity'
cask 'visual-studio-code'
cask 'zoomus'
# mac app store
mas 'Bumpr', id: 1166066070
mas 'Cyberduck', id: 409222199
mas 'Day One', id: 1055511498
mas 'Drafts', id: 1435957248
mas 'Keynote', id: 409183694
mas 'Magnet', id: 441258766
mas 'Notability', id: 736189492
mas 'Pages', id: 409201541
mas 'Parcel', id: 639968404
mas 'Pocket', id: 568494494
mas 'Reeder', id: 1449412482
mas 'Todoist', id: 585829637
mas 'Tweetbot', id: 1384080005
mas 'UlyssesMac', id: 1225570693
mas 'Xcode', id: 497799835
