# ~/.Brewfile
cask_args appdir: '/Applications'
# taps
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'jawshooah/pyenv'
tap 'nodenv/nodenv'
cask 'java'
# brews
brew 'autojump'
brew 'awscli'
brew 'composer'
brew 'dnsmasq'
brew 'elixir'
brew 'exercism'
brew 'flake8'
brew 'git'
brew 'gsl'
brew 'heroku'
brew 'htop'
brew 'kubernetes-cli'
brew 'mackup'
brew 'mas'
brew 'mongodb'
brew 'mr'
brew 'mtr'
brew 'nodenv'
brew 'nodenv-default-packages'
brew 'openssl'
brew 'php-code-sniffer'
brew 'postgresql'
brew 'pwgen'
brew 'pyenv'
brew "pyenv-default-packages", args: ["HEAD"]
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'reattach-to-user-namespace'
brew 'rust'
brew 'ssh-copy-id'
brew 'tmux'
brew 'wget'
brew 'zlib'
# casks
cask '1password'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'android-studio'
cask 'atom'
cask 'authy'
cask 'backblaze'
cask 'brave'
cask 'choosy'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'fantastical'
cask 'firefox'
cask 'font-hack'
cask 'font-inconsolata'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-hangouts'
cask 'gpg-suite'
cask 'hazel'
cask 'istat-menus'
cask 'iterm2'
cask 'keybase'
cask 'microsoft-office'
cask 'ngrok'
cask 'postman'
cask 'rescuetime'
cask 'sequel-pro'
cask 'sketch'
cask 'skype'
cask 'slack'
cask 'sonos'
cask 'spotify'
cask 'station'
cask 'steam'
cask 'synology-drive'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
# mac app store
mas 'Cyberduck', id: 409222199
mas 'Day One', id: 1055511498
mas 'Deliveries', id: 924726344
mas 'Keynote', id: 409183694
mas 'Notability', id: 736189492
mas 'Pages', id: 409201541
mas 'Pocket', id: 568494494
mas 'Reeder', id: 880001334
mas 'Simplify', id: 448003584
mas 'Todoist', id: 585829637
mas 'UlyssesMac', id: 1225570693
mas 'Xcode', id: 497799835
