# ~/.Brewfile

# taps
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'

# brews
brew 'coreutils'
brew 'mas'

# casks
cask '1password'
cask 'alfred'
cask 'brave-browser'
cask 'dash'
cask 'discord'
cask 'docker'
cask 'fantastical'
cask 'figma'
cask 'firefox'
cask 'font-jetbrains-mono'
cask 'google-chrome'
cask 'hazel'
cask 'iterm2'
cask 'keybase'
cask 'microsoft-edge'
cask 'slack'
cask 'sonos'
cask 'spotify'
cask 'stats'
cask 'syncthing'
cask 'synology-drive'
cask 'visual-studio-code'
cask 'zoomus'

# mac app store
mas 'Bumpr', id: 1166066070
mas 'Day One', id: 1055511498
mas 'Drafts', id: 1435957248
mas 'Magnet', id: 441258766
mas 'Parcel', id: 639968404
mas 'Reeder', id: 1529448980
mas 'Todoist', id: 585829637
mas 'UlyssesMac', id: 1225570693
mas 'Xcode', id: 497799835
