# ~/.Brewfile

# taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/services'
tap '1password/tap'

# brews
brew 'bat'
brew 'coreutils'
brew 'direnv'
brew 'eza'
brew 'fzf'
brew 'mas'
brew 'zsh-autosuggestions'

# casks
cask '1password'
cask '1password-cli'
cask 'android-studio'
cask 'beeper'
cask 'brave-browser'
cask 'bunch'
cask 'calibre'
cask 'discord'
cask 'docker'
cask 'element'
cask 'fantastical'
cask 'figma'
cask 'firefox@developer-edition'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'google-chrome'
cask 'hazel'
cask 'iterm2'
cask 'logi-options-plus'
cask 'logitech-camera-settings'
cask 'microsoft-edge'
cask 'microsoft-office'
cask 'minecraft'
cask 'obsidian'
cask 'opal-composer'
cask 'plexamp'
cask 'raycast'
cask 'slack'
cask 'sonos'
cask 'spotify'
cask 'stats'
cask 'steam'
cask 'synology-drive'
cask 'todoist'
cask 'visual-studio-code'
cask 'zoom'

# mac app store
mas 'OnePasswordSafari', id: 1569813296;
mas 'Bumpr', id: 1166066070;
mas 'DayOne', id: 1055511498;
mas 'Drafts', id: 1435957248;
mas 'HomeAssistant', id: 1099568401;
mas 'Tailscale', id: 1475387142;
mas 'Xcode', id: 497799835
